{
   "keras_version": "2.0.2",
   "class_name": "Sequential",
   "config": [
      {
         "class_name": "Conv2D",
         "config": {
            "trainable": true,
            "kernel_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "name": "conv2d_1",
            "use_bias": true,
            "filters": 48,
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "mode": "fan_in",
                  "seed": null,
                  "distribution": "uniform",
                  "scale": 2.0
               }
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "data_format": "channels_last",
            "activation": "linear",
            "padding": "same",
            "kernel_constraint": null,
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "batch_input_shape": [
               null,
               224,
               224,
               3
            ],
            "dilation_rate": [
               1,
               1
            ],
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "trainable": true,
            "momentum": 0.99,
            "name": "batch_normalization_1",
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "epsilon": 0.001,
            "scale": true,
            "center": true,
            "gamma_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "gamma_constraint": null,
            "beta_constraint": null,
            "beta_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "axis": 1
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "trainable": true,
            "name": "activation_1",
            "activation": "relu"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "trainable": true,
            "kernel_regularizer": null,
            "name": "conv2d_2",
            "use_bias": true,
            "filters": 108,
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "mode": "fan_in",
                  "seed": null,
                  "distribution": "uniform",
                  "scale": 2.0
               }
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "data_format": "channels_last",
            "kernel_constraint": null,
            "padding": "same",
            "activation": "linear",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "bias_regularizer": null,
            "dilation_rate": [
               1,
               1
            ],
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "rate": 0.2,
            "name": "dropout_1"
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "trainable": true,
            "momentum": 0.99,
            "name": "batch_normalization_2",
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "epsilon": 0.001,
            "scale": true,
            "center": true,
            "gamma_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "gamma_constraint": null,
            "beta_constraint": null,
            "beta_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "axis": 1
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "trainable": true,
            "name": "activation_2",
            "activation": "relu"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "trainable": true,
            "kernel_regularizer": null,
            "name": "conv2d_3",
            "use_bias": true,
            "filters": 108,
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "mode": "fan_in",
                  "seed": null,
                  "distribution": "uniform",
                  "scale": 2.0
               }
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "data_format": "channels_last",
            "kernel_constraint": null,
            "padding": "same",
            "activation": "linear",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "bias_regularizer": null,
            "dilation_rate": [
               1,
               1
            ],
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "rate": 0.2,
            "name": "dropout_2"
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "trainable": true,
            "momentum": 0.99,
            "name": "batch_normalization_3",
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "epsilon": 0.001,
            "scale": true,
            "center": true,
            "gamma_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "gamma_constraint": null,
            "beta_constraint": null,
            "beta_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "axis": 1
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "trainable": true,
            "name": "activation_3",
            "activation": "relu"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "trainable": true,
            "kernel_regularizer": null,
            "name": "conv2d_4",
            "use_bias": true,
            "filters": 108,
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "mode": "fan_in",
                  "seed": null,
                  "distribution": "uniform",
                  "scale": 2.0
               }
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "data_format": "channels_last",
            "kernel_constraint": null,
            "padding": "same",
            "activation": "linear",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "bias_regularizer": null,
            "dilation_rate": [
               1,
               1
            ],
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "rate": 0.2,
            "name": "dropout_3"
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "trainable": true,
            "momentum": 0.99,
            "name": "batch_normalization_4",
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "epsilon": 0.001,
            "scale": true,
            "center": true,
            "gamma_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "gamma_constraint": null,
            "beta_constraint": null,
            "beta_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "axis": 1
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "trainable": true,
            "name": "activation_4",
            "activation": "relu"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "trainable": true,
            "kernel_regularizer": null,
            "name": "conv2d_5",
            "use_bias": true,
            "filters": 108,
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "mode": "fan_in",
                  "seed": null,
                  "distribution": "uniform",
                  "scale": 2.0
               }
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "data_format": "channels_last",
            "kernel_constraint": null,
            "padding": "same",
            "activation": "linear",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "bias_regularizer": null,
            "dilation_rate": [
               1,
               1
            ],
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "rate": 0.2,
            "name": "dropout_4"
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "trainable": true,
            "momentum": 0.99,
            "name": "batch_normalization_5",
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "epsilon": 0.001,
            "scale": true,
            "center": true,
            "gamma_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "gamma_constraint": null,
            "beta_constraint": null,
            "beta_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "axis": 1
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "trainable": true,
            "name": "activation_5",
            "activation": "relu"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "trainable": true,
            "kernel_regularizer": null,
            "name": "conv2d_6",
            "use_bias": true,
            "filters": 108,
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "mode": "fan_in",
                  "seed": null,
                  "distribution": "uniform",
                  "scale": 2.0
               }
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "data_format": "channels_last",
            "kernel_constraint": null,
            "padding": "same",
            "activation": "linear",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "bias_regularizer": null,
            "dilation_rate": [
               1,
               1
            ],
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "rate": 0.2,
            "name": "dropout_5"
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "trainable": true,
            "momentum": 0.99,
            "name": "batch_normalization_6",
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "epsilon": 0.001,
            "scale": true,
            "center": true,
            "gamma_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "gamma_constraint": null,
            "beta_constraint": null,
            "beta_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "axis": 1
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "trainable": true,
            "name": "activation_6",
            "activation": "relu"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "trainable": true,
            "kernel_regularizer": null,
            "name": "conv2d_7",
            "use_bias": true,
            "filters": 108,
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "mode": "fan_in",
                  "seed": null,
                  "distribution": "uniform",
                  "scale": 2.0
               }
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "data_format": "channels_last",
            "kernel_constraint": null,
            "padding": "same",
            "activation": "linear",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "bias_regularizer": null,
            "dilation_rate": [
               1,
               1
            ],
            "kernel_size": [
               1,
               1
            ],
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "rate": 0.2,
            "name": "dropout_6"
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "trainable": true,
            "name": "max_pooling2d_1",
            "pool_size": [
               2,
               2
            ],
            "strides": [
               2,
               2
            ],
            "data_format": "channels_last",
            "padding": "valid"
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "trainable": true,
            "momentum": 0.99,
            "name": "batch_normalization_7",
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "epsilon": 0.001,
            "scale": true,
            "center": true,
            "gamma_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "gamma_constraint": null,
            "beta_constraint": null,
            "beta_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "axis": 1
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "trainable": true,
            "name": "activation_7",
            "activation": "relu"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "trainable": true,
            "kernel_regularizer": null,
            "name": "conv2d_8",
            "use_bias": true,
            "filters": 168,
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "mode": "fan_in",
                  "seed": null,
                  "distribution": "uniform",
                  "scale": 2.0
               }
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "data_format": "channels_last",
            "kernel_constraint": null,
            "padding": "same",
            "activation": "linear",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "bias_regularizer": null,
            "dilation_rate": [
               1,
               1
            ],
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "rate": 0.2,
            "name": "dropout_7"
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "trainable": true,
            "momentum": 0.99,
            "name": "batch_normalization_8",
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "epsilon": 0.001,
            "scale": true,
            "center": true,
            "gamma_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "gamma_constraint": null,
            "beta_constraint": null,
            "beta_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "axis": 1
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "trainable": true,
            "name": "activation_8",
            "activation": "relu"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "trainable": true,
            "kernel_regularizer": null,
            "name": "conv2d_9",
            "use_bias": true,
            "filters": 168,
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "mode": "fan_in",
                  "seed": null,
                  "distribution": "uniform",
                  "scale": 2.0
               }
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "data_format": "channels_last",
            "kernel_constraint": null,
            "padding": "same",
            "activation": "linear",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "bias_regularizer": null,
            "dilation_rate": [
               1,
               1
            ],
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "rate": 0.2,
            "name": "dropout_8"
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "trainable": true,
            "momentum": 0.99,
            "name": "batch_normalization_9",
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "epsilon": 0.001,
            "scale": true,
            "center": true,
            "gamma_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "gamma_constraint": null,
            "beta_constraint": null,
            "beta_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "axis": 1
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "trainable": true,
            "name": "activation_9",
            "activation": "relu"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "trainable": true,
            "kernel_regularizer": null,
            "name": "conv2d_10",
            "use_bias": true,
            "filters": 168,
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "mode": "fan_in",
                  "seed": null,
                  "distribution": "uniform",
                  "scale": 2.0
               }
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "data_format": "channels_last",
            "kernel_constraint": null,
            "padding": "same",
            "activation": "linear",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "bias_regularizer": null,
            "dilation_rate": [
               1,
               1
            ],
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "rate": 0.2,
            "name": "dropout_9"
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "trainable": true,
            "momentum": 0.99,
            "name": "batch_normalization_10",
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "epsilon": 0.001,
            "scale": true,
            "center": true,
            "gamma_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "gamma_constraint": null,
            "beta_constraint": null,
            "beta_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "axis": 1
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "trainable": true,
            "name": "activation_10",
            "activation": "relu"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "trainable": true,
            "kernel_regularizer": null,
            "name": "conv2d_11",
            "use_bias": true,
            "filters": 168,
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "mode": "fan_in",
                  "seed": null,
                  "distribution": "uniform",
                  "scale": 2.0
               }
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "data_format": "channels_last",
            "kernel_constraint": null,
            "padding": "same",
            "activation": "linear",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "bias_regularizer": null,
            "dilation_rate": [
               1,
               1
            ],
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "rate": 0.2,
            "name": "dropout_10"
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "trainable": true,
            "momentum": 0.99,
            "name": "batch_normalization_11",
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "epsilon": 0.001,
            "scale": true,
            "center": true,
            "gamma_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "gamma_constraint": null,
            "beta_constraint": null,
            "beta_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "axis": 1
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "trainable": true,
            "name": "activation_11",
            "activation": "relu"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "trainable": true,
            "kernel_regularizer": null,
            "name": "conv2d_12",
            "use_bias": true,
            "filters": 168,
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "mode": "fan_in",
                  "seed": null,
                  "distribution": "uniform",
                  "scale": 2.0
               }
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "data_format": "channels_last",
            "kernel_constraint": null,
            "padding": "same",
            "activation": "linear",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "bias_regularizer": null,
            "dilation_rate": [
               1,
               1
            ],
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "rate": 0.2,
            "name": "dropout_11"
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "trainable": true,
            "momentum": 0.99,
            "name": "batch_normalization_12",
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "epsilon": 0.001,
            "scale": true,
            "center": true,
            "gamma_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "gamma_constraint": null,
            "beta_constraint": null,
            "beta_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "axis": 1
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "trainable": true,
            "name": "activation_12",
            "activation": "relu"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "trainable": true,
            "kernel_regularizer": null,
            "name": "conv2d_13",
            "use_bias": true,
            "filters": 168,
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "mode": "fan_in",
                  "seed": null,
                  "distribution": "uniform",
                  "scale": 2.0
               }
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "data_format": "channels_last",
            "kernel_constraint": null,
            "padding": "same",
            "activation": "linear",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "bias_regularizer": null,
            "dilation_rate": [
               1,
               1
            ],
            "kernel_size": [
               1,
               1
            ],
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "rate": 0.2,
            "name": "dropout_12"
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "trainable": true,
            "name": "max_pooling2d_2",
            "pool_size": [
               2,
               2
            ],
            "strides": [
               2,
               2
            ],
            "data_format": "channels_last",
            "padding": "valid"
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "trainable": true,
            "momentum": 0.99,
            "name": "batch_normalization_13",
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "epsilon": 0.001,
            "scale": true,
            "center": true,
            "gamma_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "gamma_constraint": null,
            "beta_constraint": null,
            "beta_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "axis": 1
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "trainable": true,
            "name": "activation_13",
            "activation": "relu"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "trainable": true,
            "kernel_regularizer": null,
            "name": "conv2d_14",
            "use_bias": true,
            "filters": 228,
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "mode": "fan_in",
                  "seed": null,
                  "distribution": "uniform",
                  "scale": 2.0
               }
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "data_format": "channels_last",
            "kernel_constraint": null,
            "padding": "same",
            "activation": "linear",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "bias_regularizer": null,
            "dilation_rate": [
               1,
               1
            ],
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "rate": 0.2,
            "name": "dropout_13"
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "trainable": true,
            "momentum": 0.99,
            "name": "batch_normalization_14",
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "epsilon": 0.001,
            "scale": true,
            "center": true,
            "gamma_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "gamma_constraint": null,
            "beta_constraint": null,
            "beta_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "axis": 1
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "trainable": true,
            "name": "activation_14",
            "activation": "relu"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "trainable": true,
            "kernel_regularizer": null,
            "name": "conv2d_15",
            "use_bias": true,
            "filters": 228,
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "mode": "fan_in",
                  "seed": null,
                  "distribution": "uniform",
                  "scale": 2.0
               }
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "data_format": "channels_last",
            "kernel_constraint": null,
            "padding": "same",
            "activation": "linear",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "bias_regularizer": null,
            "dilation_rate": [
               1,
               1
            ],
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "rate": 0.2,
            "name": "dropout_14"
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "trainable": true,
            "momentum": 0.99,
            "name": "batch_normalization_15",
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "epsilon": 0.001,
            "scale": true,
            "center": true,
            "gamma_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "gamma_constraint": null,
            "beta_constraint": null,
            "beta_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "axis": 1
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "trainable": true,
            "name": "activation_15",
            "activation": "relu"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "trainable": true,
            "kernel_regularizer": null,
            "name": "conv2d_16",
            "use_bias": true,
            "filters": 228,
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "mode": "fan_in",
                  "seed": null,
                  "distribution": "uniform",
                  "scale": 2.0
               }
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "data_format": "channels_last",
            "kernel_constraint": null,
            "padding": "same",
            "activation": "linear",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "bias_regularizer": null,
            "dilation_rate": [
               1,
               1
            ],
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "rate": 0.2,
            "name": "dropout_15"
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "trainable": true,
            "momentum": 0.99,
            "name": "batch_normalization_16",
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "epsilon": 0.001,
            "scale": true,
            "center": true,
            "gamma_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "gamma_constraint": null,
            "beta_constraint": null,
            "beta_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "axis": 1
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "trainable": true,
            "name": "activation_16",
            "activation": "relu"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "trainable": true,
            "kernel_regularizer": null,
            "name": "conv2d_17",
            "use_bias": true,
            "filters": 228,
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "mode": "fan_in",
                  "seed": null,
                  "distribution": "uniform",
                  "scale": 2.0
               }
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "data_format": "channels_last",
            "kernel_constraint": null,
            "padding": "same",
            "activation": "linear",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "bias_regularizer": null,
            "dilation_rate": [
               1,
               1
            ],
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "rate": 0.2,
            "name": "dropout_16"
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "trainable": true,
            "momentum": 0.99,
            "name": "batch_normalization_17",
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "epsilon": 0.001,
            "scale": true,
            "center": true,
            "gamma_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "gamma_constraint": null,
            "beta_constraint": null,
            "beta_regularizer": {
               "class_name": "L1L2",
               "config": {
                  "l2": 9.999999747378752e-05,
                  "l1": 0.0
               }
            },
            "axis": 1
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "trainable": true,
            "name": "activation_17",
            "activation": "relu"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "trainable": true,
            "kernel_regularizer": null,
            "name": "conv2d_18",
            "use_bias": true,
            "filters": 228,
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "mode": "fan_in",
                  "seed": null,
                  "distribution": "uniform",
                  "scale": 2.0
               }
            },
            "activity_regularizer": null,
            "bias_constraint": null,
            "data_format": "channels_last",
            "kernel_constraint": null,
            "padding": "same",
            "activation": "linear",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "bias_regularizer": null,
            "dilation_rate": [
               1,
               1
            ],
            "kernel_size": [
               3,
               3
            ],
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "rate": 0.2,
            "name": "dropout_17"
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "trainable": true,
            "momentum": 0.99,
            "name": "batch_normalization_18",
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "epsilon": 0.001,
            "scale": true,
            "center": true,
