{
   "class_name": "Sequential", 
   "keras_version": "1.2.0", 
   "config": [
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_1", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 48, 
            "activation": "linear", 
            "input_dtype": "float32", 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "batch_input_shape": [
               null, 
               3, 
               224, 
               224
            ], 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_1", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_1"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_2", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 112, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_1"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_2", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_2"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_3", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 112, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_2"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_3", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_3"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_4", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 112, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_3"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_4", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_4"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_5", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 112, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_4"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_5", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_5"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_6", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 1, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 112, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 1, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_5"
         }
      }, 
      {
         "class_name": "MaxPooling2D", 
         "config": {
            "name": "maxpooling2d_1", 
            "trainable": true, 
            "dim_ordering": "th", 
            "pool_size": [
               2, 
               2
            ], 
            "strides": [
               2, 
               2
            ], 
            "border_mode": "valid"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_6", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_6"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_7", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 192, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_6"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_7", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_7"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_8", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 192, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_7"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_8", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_8"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_9", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 192, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_8"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_9", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_9"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_10", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 192, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_9"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_10", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_10"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_11", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 192, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_10"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_11", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_11"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_12", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 1, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 192, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 1, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_11"
         }
      }, 
      {
         "class_name": "MaxPooling2D", 
         "config": {
            "name": "maxpooling2d_2", 
            "trainable": true, 
            "dim_ordering": "th", 
            "pool_size": [
               2, 
               2
            ], 
            "strides": [
               2, 
               2
            ], 
            "border_mode": "valid"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_12", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_12"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_13", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 304, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_12"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_13", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_13"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_14", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 304, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_13"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_14", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_14"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_15", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 304, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_14"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_15", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_15"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_16", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 304, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_15"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_16", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_16"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_17", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 304, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_16"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_17", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_17"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_18", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 304, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_17"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_18", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_18"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_19", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 304, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_18"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_19", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_19"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_20", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 1, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 304, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 1, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_19"
         }
      }, 
      {
         "class_name": "MaxPooling2D", 
         "config": {
            "name": "maxpooling2d_3", 
            "trainable": true, 
            "dim_ordering": "th", 
            "pool_size": [
               2, 
               2
            ], 
            "strides": [
               2, 
               2
            ], 
            "border_mode": "valid"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_20", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_20"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_21", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 464, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_20"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_21", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_21"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_22", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 464, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_21"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_22", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_22"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_23", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 464, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_22"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_23", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_23"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_24", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 464, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_23"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_24", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_24"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_25", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 464, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_24"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_25", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_25"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_26", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 464, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_25"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_26", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_26"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_27", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 464, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_26"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_27", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_27"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_28", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 464, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_27"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_28", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_28"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_29", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 464, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_28"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_29", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_29"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_30", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 464, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_29"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_30", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_30"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_31", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 1, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 464, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 1, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_30"
         }
      }, 
      {
         "class_name": "MaxPooling2D", 
         "config": {
            "name": "maxpooling2d_4", 
            "trainable": true, 
            "dim_ordering": "th", 
            "pool_size": [
               2, 
               2
            ], 
            "strides": [
               2, 
               2
            ], 
            "border_mode": "valid"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_31", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_31"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_32", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 656, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_31"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_32", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_32"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_33", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 656, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_32"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_33", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_33"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_34", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 656, 
            "b_regularizer": null, 
            "W_regularizer": null, 
            "nb_row": 3, 
            "activation": "linear", 
            "border_mode": "same"
         }
      }, 
      {
         "class_name": "Dropout", 
         "config": {
            "p": 0.2, 
            "trainable": true, 
            "name": "dropout_33"
         }
      }, 
      {
         "class_name": "BatchNormalization", 
         "config": {
            "gamma_regularizer": null, 
            "name": "batchnormalization_34", 
            "epsilon": 0.001, 
            "trainable": true, 
            "mode": 0, 
            "beta_regularizer": null, 
            "momentum": 0.99, 
            "axis": -1
         }
      }, 
      {
         "class_name": "Activation", 
         "config": {
            "activation": "relu", 
            "trainable": true, 
            "name": "activation_34"
         }
      }, 
      {
         "class_name": "Convolution2D", 
         "config": {
            "W_constraint": null, 
            "b_constraint": null, 
            "name": "convolution2d_35", 
            "activity_regularizer": null, 
            "trainable": true, 
            "dim_ordering": "th", 
            "nb_col": 3, 
            "subsample": [
               1, 
               1
            ], 
            "init": "glorot_uniform", 
            "bias": true, 
            "nb_filter": 656, 
