{
   "class_name": "Sequential",
   "keras_version": "2.0.2",
   "config": [
      {
         "class_name": "Conv2D",
         "config": {
            "data_format": "channels_first",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "batch_input_shape": [
               null,
               3,
               224,
               224
            ],
            "kernel_size": [
               3,
               3
            ],
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null
               }
            },
            "activity_regularizer": null,
            "filters": 48,
            "activation": "linear",
            "padding": "same",
            "dilation_rate": [
               1,
               1
            ],
            "kernel_regularizer": null,
            "trainable": true,
            "bias_regularizer": null,
            "use_bias": true,
            "dtype": "float32",
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "conv2d_1",
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "gamma_constraint": null,
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "axis": -1,
            "momentum": 0.99,
            "center": true,
            "epsilon": 0.001,
            "gamma_regularizer": null,
            "trainable": true,
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_constraint": null,
            "scale": true,
            "beta_regularizer": null,
            "name": "batch_normalization_1",
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            }
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "activation": "relu",
            "trainable": true,
            "name": "activation_1"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "data_format": "channels_first",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_constraint": null,
            "kernel_size": [
               3,
               3
            ],
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null
               }
            },
            "activity_regularizer": null,
            "filters": 112,
            "activation": "linear",
            "padding": "same",
            "dilation_rate": [
               1,
               1
            ],
            "kernel_regularizer": null,
            "trainable": true,
            "bias_regularizer": null,
            "use_bias": true,
            "bias_constraint": null,
            "name": "conv2d_2",
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "name": "dropout_1",
            "rate": 0.2
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "gamma_constraint": null,
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "axis": -1,
            "momentum": 0.99,
            "center": true,
            "epsilon": 0.001,
            "gamma_regularizer": null,
            "trainable": true,
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_constraint": null,
            "scale": true,
            "beta_regularizer": null,
            "name": "batch_normalization_2",
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            }
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "activation": "relu",
            "trainable": true,
            "name": "activation_2"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "data_format": "channels_first",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_constraint": null,
            "kernel_size": [
               3,
               3
            ],
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null
               }
            },
            "activity_regularizer": null,
            "filters": 112,
            "activation": "linear",
            "padding": "same",
            "dilation_rate": [
               1,
               1
            ],
            "kernel_regularizer": null,
            "trainable": true,
            "bias_regularizer": null,
            "use_bias": true,
            "bias_constraint": null,
            "name": "conv2d_3",
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "name": "dropout_2",
            "rate": 0.2
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "gamma_constraint": null,
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "axis": -1,
            "momentum": 0.99,
            "center": true,
            "epsilon": 0.001,
            "gamma_regularizer": null,
            "trainable": true,
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_constraint": null,
            "scale": true,
            "beta_regularizer": null,
            "name": "batch_normalization_3",
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            }
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "activation": "relu",
            "trainable": true,
            "name": "activation_3"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "data_format": "channels_first",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_constraint": null,
            "kernel_size": [
               3,
               3
            ],
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null
               }
            },
            "activity_regularizer": null,
            "filters": 112,
            "activation": "linear",
            "padding": "same",
            "dilation_rate": [
               1,
               1
            ],
            "kernel_regularizer": null,
            "trainable": true,
            "bias_regularizer": null,
            "use_bias": true,
            "bias_constraint": null,
            "name": "conv2d_4",
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "name": "dropout_3",
            "rate": 0.2
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "gamma_constraint": null,
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "axis": -1,
            "momentum": 0.99,
            "center": true,
            "epsilon": 0.001,
            "gamma_regularizer": null,
            "trainable": true,
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_constraint": null,
            "scale": true,
            "beta_regularizer": null,
            "name": "batch_normalization_4",
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            }
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "activation": "relu",
            "trainable": true,
            "name": "activation_4"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "data_format": "channels_first",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_constraint": null,
            "kernel_size": [
               3,
               3
            ],
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null
               }
            },
            "activity_regularizer": null,
            "filters": 112,
            "activation": "linear",
            "padding": "same",
            "dilation_rate": [
               1,
               1
            ],
            "kernel_regularizer": null,
            "trainable": true,
            "bias_regularizer": null,
            "use_bias": true,
            "bias_constraint": null,
            "name": "conv2d_5",
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "name": "dropout_4",
            "rate": 0.2
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "gamma_constraint": null,
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "axis": -1,
            "momentum": 0.99,
            "center": true,
            "epsilon": 0.001,
            "gamma_regularizer": null,
            "trainable": true,
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_constraint": null,
            "scale": true,
            "beta_regularizer": null,
            "name": "batch_normalization_5",
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            }
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "activation": "relu",
            "trainable": true,
            "name": "activation_5"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "data_format": "channels_first",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_constraint": null,
            "kernel_size": [
               1,
               1
            ],
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null
               }
            },
            "activity_regularizer": null,
            "filters": 112,
            "activation": "linear",
            "padding": "same",
            "dilation_rate": [
               1,
               1
            ],
            "kernel_regularizer": null,
            "trainable": true,
            "bias_regularizer": null,
            "use_bias": true,
            "bias_constraint": null,
            "name": "conv2d_6",
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "name": "dropout_5",
            "rate": 0.2
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "pool_size": [
               2,
               2
            ],
            "data_format": "channels_first",
            "trainable": true,
            "padding": "valid",
            "name": "max_pooling2d_1",
            "strides": [
               2,
               2
            ]
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "gamma_constraint": null,
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "axis": -1,
            "momentum": 0.99,
            "center": true,
            "epsilon": 0.001,
            "gamma_regularizer": null,
            "trainable": true,
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_constraint": null,
            "scale": true,
            "beta_regularizer": null,
            "name": "batch_normalization_6",
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            }
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "activation": "relu",
            "trainable": true,
            "name": "activation_6"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "data_format": "channels_first",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_constraint": null,
            "kernel_size": [
               3,
               3
            ],
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null
               }
            },
            "activity_regularizer": null,
            "filters": 192,
            "activation": "linear",
            "padding": "same",
            "dilation_rate": [
               1,
               1
            ],
            "kernel_regularizer": null,
            "trainable": true,
            "bias_regularizer": null,
            "use_bias": true,
            "bias_constraint": null,
            "name": "conv2d_7",
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "name": "dropout_6",
            "rate": 0.2
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "gamma_constraint": null,
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "axis": -1,
            "momentum": 0.99,
            "center": true,
            "epsilon": 0.001,
            "gamma_regularizer": null,
            "trainable": true,
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_constraint": null,
            "scale": true,
            "beta_regularizer": null,
            "name": "batch_normalization_7",
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            }
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "activation": "relu",
            "trainable": true,
            "name": "activation_7"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "data_format": "channels_first",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_constraint": null,
            "kernel_size": [
               3,
               3
            ],
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null
               }
            },
            "activity_regularizer": null,
            "filters": 192,
            "activation": "linear",
            "padding": "same",
            "dilation_rate": [
               1,
               1
            ],
            "kernel_regularizer": null,
            "trainable": true,
            "bias_regularizer": null,
            "use_bias": true,
            "bias_constraint": null,
            "name": "conv2d_8",
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "name": "dropout_7",
            "rate": 0.2
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "gamma_constraint": null,
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "axis": -1,
            "momentum": 0.99,
            "center": true,
            "epsilon": 0.001,
            "gamma_regularizer": null,
            "trainable": true,
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_constraint": null,
            "scale": true,
            "beta_regularizer": null,
            "name": "batch_normalization_8",
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            }
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "activation": "relu",
            "trainable": true,
            "name": "activation_8"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "data_format": "channels_first",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_constraint": null,
            "kernel_size": [
               3,
               3
            ],
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null
               }
            },
            "activity_regularizer": null,
            "filters": 192,
            "activation": "linear",
            "padding": "same",
            "dilation_rate": [
               1,
               1
            ],
            "kernel_regularizer": null,
            "trainable": true,
            "bias_regularizer": null,
            "use_bias": true,
            "bias_constraint": null,
            "name": "conv2d_9",
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "name": "dropout_8",
            "rate": 0.2
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "gamma_constraint": null,
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "axis": -1,
            "momentum": 0.99,
            "center": true,
            "epsilon": 0.001,
            "gamma_regularizer": null,
            "trainable": true,
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_constraint": null,
            "scale": true,
            "beta_regularizer": null,
            "name": "batch_normalization_9",
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            }
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "activation": "relu",
            "trainable": true,
            "name": "activation_9"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "data_format": "channels_first",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_constraint": null,
            "kernel_size": [
               3,
               3
            ],
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null
               }
            },
            "activity_regularizer": null,
            "filters": 192,
            "activation": "linear",
            "padding": "same",
            "dilation_rate": [
               1,
               1
            ],
            "kernel_regularizer": null,
            "trainable": true,
            "bias_regularizer": null,
            "use_bias": true,
            "bias_constraint": null,
            "name": "conv2d_10",
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "name": "dropout_9",
            "rate": 0.2
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "gamma_constraint": null,
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "axis": -1,
            "momentum": 0.99,
            "center": true,
            "epsilon": 0.001,
            "gamma_regularizer": null,
            "trainable": true,
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_constraint": null,
            "scale": true,
            "beta_regularizer": null,
            "name": "batch_normalization_10",
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            }
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "activation": "relu",
            "trainable": true,
            "name": "activation_10"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "data_format": "channels_first",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_constraint": null,
            "kernel_size": [
               3,
               3
            ],
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null
               }
            },
            "activity_regularizer": null,
            "filters": 192,
            "activation": "linear",
            "padding": "same",
            "dilation_rate": [
               1,
               1
            ],
            "kernel_regularizer": null,
            "trainable": true,
            "bias_regularizer": null,
            "use_bias": true,
            "bias_constraint": null,
            "name": "conv2d_11",
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "name": "dropout_10",
            "rate": 0.2
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "gamma_constraint": null,
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "axis": -1,
            "momentum": 0.99,
            "center": true,
            "epsilon": 0.001,
            "gamma_regularizer": null,
            "trainable": true,
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_constraint": null,
            "scale": true,
            "beta_regularizer": null,
            "name": "batch_normalization_11",
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            }
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "activation": "relu",
            "trainable": true,
            "name": "activation_11"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "data_format": "channels_first",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_constraint": null,
            "kernel_size": [
               1,
               1
            ],
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null
               }
            },
            "activity_regularizer": null,
            "filters": 192,
            "activation": "linear",
            "padding": "same",
            "dilation_rate": [
               1,
               1
            ],
            "kernel_regularizer": null,
            "trainable": true,
            "bias_regularizer": null,
            "use_bias": true,
            "bias_constraint": null,
            "name": "conv2d_12",
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "name": "dropout_11",
            "rate": 0.2
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "pool_size": [
               2,
               2
            ],
            "data_format": "channels_first",
            "trainable": true,
            "padding": "valid",
            "name": "max_pooling2d_2",
            "strides": [
               2,
               2
            ]
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "gamma_constraint": null,
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "axis": -1,
            "momentum": 0.99,
            "center": true,
            "epsilon": 0.001,
            "gamma_regularizer": null,
            "trainable": true,
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_constraint": null,
            "scale": true,
            "beta_regularizer": null,
            "name": "batch_normalization_12",
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            }
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "activation": "relu",
            "trainable": true,
            "name": "activation_12"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "data_format": "channels_first",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_constraint": null,
            "kernel_size": [
               3,
               3
            ],
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null
               }
            },
            "activity_regularizer": null,
            "filters": 304,
            "activation": "linear",
            "padding": "same",
            "dilation_rate": [
               1,
               1
            ],
            "kernel_regularizer": null,
            "trainable": true,
            "bias_regularizer": null,
            "use_bias": true,
            "bias_constraint": null,
            "name": "conv2d_13",
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "name": "dropout_12",
            "rate": 0.2
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "gamma_constraint": null,
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "axis": -1,
            "momentum": 0.99,
            "center": true,
            "epsilon": 0.001,
            "gamma_regularizer": null,
            "trainable": true,
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_constraint": null,
            "scale": true,
            "beta_regularizer": null,
            "name": "batch_normalization_13",
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            }
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "activation": "relu",
            "trainable": true,
            "name": "activation_13"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "data_format": "channels_first",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_constraint": null,
            "kernel_size": [
               3,
               3
            ],
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null
               }
            },
            "activity_regularizer": null,
            "filters": 304,
            "activation": "linear",
            "padding": "same",
            "dilation_rate": [
               1,
               1
            ],
            "kernel_regularizer": null,
            "trainable": true,
            "bias_regularizer": null,
            "use_bias": true,
            "bias_constraint": null,
            "name": "conv2d_14",
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "name": "dropout_13",
            "rate": 0.2
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "gamma_constraint": null,
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "axis": -1,
            "momentum": 0.99,
            "center": true,
            "epsilon": 0.001,
            "gamma_regularizer": null,
            "trainable": true,
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_constraint": null,
            "scale": true,
            "beta_regularizer": null,
            "name": "batch_normalization_14",
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            }
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "activation": "relu",
            "trainable": true,
            "name": "activation_14"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "data_format": "channels_first",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_constraint": null,
            "kernel_size": [
               3,
               3
            ],
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null
               }
            },
            "activity_regularizer": null,
            "filters": 304,
            "activation": "linear",
            "padding": "same",
            "dilation_rate": [
               1,
               1
            ],
            "kernel_regularizer": null,
            "trainable": true,
            "bias_regularizer": null,
            "use_bias": true,
            "bias_constraint": null,
            "name": "conv2d_15",
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "name": "dropout_14",
            "rate": 0.2
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "gamma_constraint": null,
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "axis": -1,
            "momentum": 0.99,
            "center": true,
            "epsilon": 0.001,
            "gamma_regularizer": null,
            "trainable": true,
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_constraint": null,
            "scale": true,
            "beta_regularizer": null,
            "name": "batch_normalization_15",
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            }
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "activation": "relu",
            "trainable": true,
            "name": "activation_15"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "data_format": "channels_first",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_constraint": null,
            "kernel_size": [
               3,
               3
            ],
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null
               }
            },
            "activity_regularizer": null,
            "filters": 304,
            "activation": "linear",
            "padding": "same",
            "dilation_rate": [
               1,
               1
            ],
            "kernel_regularizer": null,
            "trainable": true,
            "bias_regularizer": null,
            "use_bias": true,
            "bias_constraint": null,
            "name": "conv2d_16",
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "name": "dropout_15",
            "rate": 0.2
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "gamma_constraint": null,
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "axis": -1,
            "momentum": 0.99,
            "center": true,
            "epsilon": 0.001,
            "gamma_regularizer": null,
            "trainable": true,
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_constraint": null,
            "scale": true,
            "beta_regularizer": null,
            "name": "batch_normalization_16",
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            }
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "activation": "relu",
            "trainable": true,
            "name": "activation_16"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "data_format": "channels_first",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_constraint": null,
            "kernel_size": [
               3,
               3
            ],
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null
               }
            },
            "activity_regularizer": null,
            "filters": 304,
            "activation": "linear",
            "padding": "same",
            "dilation_rate": [
               1,
               1
            ],
            "kernel_regularizer": null,
            "trainable": true,
            "bias_regularizer": null,
            "use_bias": true,
            "bias_constraint": null,
            "name": "conv2d_17",
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "name": "dropout_16",
            "rate": 0.2
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "gamma_constraint": null,
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "axis": -1,
            "momentum": 0.99,
            "center": true,
            "epsilon": 0.001,
            "gamma_regularizer": null,
            "trainable": true,
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_constraint": null,
            "scale": true,
            "beta_regularizer": null,
            "name": "batch_normalization_17",
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            }
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "activation": "relu",
            "trainable": true,
            "name": "activation_17"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "data_format": "channels_first",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_constraint": null,
            "kernel_size": [
               3,
               3
            ],
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null
               }
            },
            "activity_regularizer": null,
            "filters": 304,
            "activation": "linear",
            "padding": "same",
            "dilation_rate": [
               1,
               1
            ],
            "kernel_regularizer": null,
            "trainable": true,
            "bias_regularizer": null,
            "use_bias": true,
            "bias_constraint": null,
            "name": "conv2d_18",
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "name": "dropout_17",
            "rate": 0.2
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "gamma_constraint": null,
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "axis": -1,
            "momentum": 0.99,
            "center": true,
            "epsilon": 0.001,
            "gamma_regularizer": null,
            "trainable": true,
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_constraint": null,
            "scale": true,
            "beta_regularizer": null,
            "name": "batch_normalization_18",
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            }
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "activation": "relu",
            "trainable": true,
            "name": "activation_18"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "data_format": "channels_first",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_constraint": null,
            "kernel_size": [
               3,
               3
            ],
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null
               }
            },
            "activity_regularizer": null,
            "filters": 304,
            "activation": "linear",
            "padding": "same",
            "dilation_rate": [
               1,
               1
            ],
            "kernel_regularizer": null,
            "trainable": true,
            "bias_regularizer": null,
            "use_bias": true,
            "bias_constraint": null,
            "name": "conv2d_19",
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "name": "dropout_18",
            "rate": 0.2
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "gamma_constraint": null,
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "axis": -1,
            "momentum": 0.99,
            "center": true,
            "epsilon": 0.001,
            "gamma_regularizer": null,
            "trainable": true,
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_constraint": null,
            "scale": true,
            "beta_regularizer": null,
            "name": "batch_normalization_19",
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            }
         }
      },
      {
         "class_name": "Activation",
         "config": {
            "activation": "relu",
            "trainable": true,
            "name": "activation_19"
         }
      },
      {
         "class_name": "Conv2D",
         "config": {
            "data_format": "channels_first",
            "bias_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "kernel_constraint": null,
            "kernel_size": [
               1,
               1
            ],
            "kernel_initializer": {
               "class_name": "VarianceScaling",
               "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "seed": null
               }
            },
            "activity_regularizer": null,
            "filters": 304,
            "activation": "linear",
            "padding": "same",
            "dilation_rate": [
               1,
               1
            ],
            "kernel_regularizer": null,
            "trainable": true,
            "bias_regularizer": null,
            "use_bias": true,
            "bias_constraint": null,
            "name": "conv2d_20",
            "strides": [
               1,
               1
            ]
         }
      },
      {
         "class_name": "Dropout",
         "config": {
            "trainable": true,
            "name": "dropout_19",
            "rate": 0.2
         }
      },
      {
         "class_name": "MaxPooling2D",
         "config": {
            "pool_size": [
               2,
               2
            ],
            "data_format": "channels_first",
            "trainable": true,
            "padding": "valid",
            "name": "max_pooling2d_3",
            "strides": [
               2,
               2
            ]
         }
      },
      {
         "class_name": "BatchNormalization",
         "config": {
            "gamma_constraint": null,
            "gamma_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_initializer": {
               "class_name": "Zeros",
               "config": {}
            },
            "axis": -1,
            "momentum": 0.99,
            "center": true,
            "epsilon": 0.001,
            "gamma_regularizer": null,
            "trainable": true,
            "moving_variance_initializer": {
               "class_name": "Ones",
               "config": {}
            },
            "beta_constraint": null,
            "scale": true,
            "beta_regularizer": null,
            "name": "batch_normalization_20",
            "moving_mean_initializer": {
               "class_name": "Zeros",
               "config": {}
            }
         }
      },
      {
         "class_name": "Activation",
         "config": {
